Public Attributes | List of all members
API_StairStructureComponentSettingsVisibility Struct Reference
Element Manager API
Settings for visibility of the stair component strucutre. More...
#include <APIdefs_Elements.h>
 Public Attributes
bool  | uniformSymbolRepresentationEnabled
API_StairStructureComponentSettingsVisibilityOnStory  | structureVisibilityOnStories [API_StairStructSymbRelevantStoriesNum]
Detailed Description
Settings for visibility of the stair component strucutre.
Member Data Documentation
◆ structureVisibilityOnStories
 API_StairStructureComponentSettingsVisibilityOnStory API_StairStructureComponentSettingsVisibility::structureVisibilityOnStories[API_StairStructSymbRelevantStoriesNum]
◆ uniformSymbolRepresentationEnabled
 bool API_StairStructureComponentSettingsVisibility::uniformSymbolRepresentationEnabled